{
    "courses": [
      {
        "id": 1,
        "slug": "guitar-fundamentals",
        "title": "Guitar Fundamentals",
        "description": "Learn the basics of playing guitar with our comprehensive beginner's course.",
        "price": 99.99,
        "instructor": "John Doe",
        "isFeatured": true,
        "image": "/courses/guitar.jpg"
      },
      {
        "id": 2,
        "slug": "advanced-javascript-mastery",
        "title": "Advanced JavaScript Mastery",
        "description": "Dive deep into complex JavaScript concepts, asynchronous programming, and functional programming techniques.",
        "price": 129.99,
        "instructor": "Jane Smith",
        "isFeatured": true,
        "image": "/courses/js-advanced.jpg"
      },
      {
        "id": 3,
        "slug": "react-for-beginners",
        "title": "React for Beginners",
        "description": "Learn the fundamentals of React, build interactive user interfaces, and understand component-based architecture.",
        "price": 79.99,
        "instructor": "Alex Lee",
        "isFeatured": false,
        "image": "/courses/react-basics.jpg"
      },
      {
        "id": 4,
        "slug": "nodejs-express-restful-apis",
        "title": "Node.js Express: RESTful APIs",
        "description": "Create robust RESTful APIs using Node.js and Express.",
        "price": 109.99,
        "instructor": "Michael Johnson",
        "isFeatured": true,
        "image": "/courses/nodejs-express.jpg"
      },
      {
        "id": 5,
        "slug": "piano-harmony-essentials",
        "title": "Piano Harmony Essentials",
        "description": "Unlock the secrets of chord progressions, inversions, and harmonization techniques on the piano.",
        "price": 89.99,
        "instructor": "Emily Chen",
        "isFeatured": true,
        "image": "/courses/piano-harmony.jpg"
      },
      {
        "id": 6,
        "slug": "songwriting-101",
        "title": "Songwriting 101: From Lyrics to Melodies",
        "description": "Craft your own songs by mastering the art of songwriting.",
        "price": 69.99,
        "instructor": "David Rodriguez",
        "isFeatured": false,
        "image": "/courses/songwriting.jpg"
      }
    ],
    "content": [
      {
        "title": "Experienced Instructors",
        "description": "Learn from passionate and skilled instructors who have years of experience in the music industry. Our teachers are dedicated to helping you reach your musical goals."
      },
      {
        "title": "Diverse Course Offerings",
        "description": "Explore a wide range of music courses, from classical to contemporary. Whether you're interested in playing an instrument, singing, or music theory, we've got you covered."
      },
      {
        "title": "Interactive Learning",
        "description": "Engage in interactive lessons that keep you motivated and excited about learning music. Our hands-on approach ensures that you'll progress quickly and enjoy the process."
      },
      {
        "title": "Interactive Learning",
        "description": "Engage in interactive lessons that keep you motivated and excited about learning music. Our hands-on approach ensures that you'll progress quickly and enjoy the process."
      },
      {
        "title": "Supportive Community",
        "description": "Join a vibrant community of music enthusiasts. Connect with fellow students, attend workshops, and participate in recitals. We're here to support you every step of the way."
      }
    ],
    "testimonials": [
      {
        "quote": "As a violinist, finding the right mentor can be challenging, but this school matched me with a teacher who truly understands my goals and challenges.",
        "name": "Emily Taylor",
        "title": "Violin Student"
      },
      {
        "quote": "The production courses here opened my eyes to the intricacies of music production. Highly recommend for any aspiring producers!",
        "name": "Chris Morales",
        "title": "Music Production Student"
      },
      {
        "quote": "The faculty here are not only knowledgeable but also approachable and supportive. I've grown so much as a musician.",
        "name": "Alex Johnson",
        "title": "Piano Student"
      },
      {
        "quote": "The state-of-the-art facilities and resources available to students are simply unparalleled. It's an amazing environment to learn and create.",
        "name": "Samantha Lee",
        "title": "Sound Engineering Student"
      },
      {
        "quote": "I've never felt more inspired and challenged. The community here is incredibly talented and motivating.",
        "name": "David Kim",
        "title": "Jazz Studies Student"
      }
    ],
    "webinars": [
      {
        "title": "The Evolution of Jazz: From Louis Armstrong to Miles Davis",
        "description": "Explore the rich history and evolution of jazz music, featuring the works and influences of legendary artists like Louis Armstrong and Miles Davis.",
        "slug": "evolution-of-jazz",
        "isFeatured": true
      },
      {
          "title": "The Impact of Technology on Modern Music Production",
          "description": "Discover how technological advancements have transformed music production, from analog to digital, and the tools that are shaping the sound of today.",
          "slug": "technology-in-music-production",
          "isFeatured": true
      },
      {
          "title": "The Power of Lyrics: Songwriting Techniques from the Pros",
          "description": "Learn songwriting techniques from professional lyricists and composers, and understand the importance of lyrics in crafting memorable and impactful songs.",
          "slug": "power-of-lyrics",
          "isFeatured": true
      },
      {
          "title": "The Influence of Classical Music on Contemporary Genres",
          "description": "Examine how classical music has influenced various contemporary genres, including rock, pop, and electronic music.",
          "slug": "classical-music-influence",
          "isFeatured": true
      },
      {
          "title": "Music Therapy: Healing Through Sound",
          "description": "Understand the principles of music therapy and how sound can be used as a therapeutic tool to promote mental and emotional well-being.",
          "slug": "music-therapy",
          "isFeatured": true
      },
      {
          "title": "The Business of Music: Navigating the Modern Music Industry",
          "description": "Gain insights into the modern music industry, covering topics such as copyright, royalties, marketing, and the role of streaming services.",
          "slug": "business-of-music",
          "isFeatured": true
      }
    ]
}
  